{"version":"https://jsonfeed.org/version/1.1","title":"open source on Phillip Carter's blog","description":"Usually writing about F#","home_page_url":"https://phillipcarter.dev","feed_url":"https://phillipcarter.dev/tags/open-source/feed.json","authors":[{"name":"Phillip Carter"}],"items":[{"title":"The F# project-product duality","date_published":"2020-12-30T00:00:00Z","date_modified":"2021-02-28T16:22:54-08:00","id":"https://phillipcarter.dev/posts/fsharp-project-product-duality/","url":"https://phillipcarter.dev/posts/fsharp-project-product-duality/","content_html":"\u003cp\u003eThe F# language is kind of wierd (in a good way). Born out of Microsoft Research and initially sold to the world by Microsoft as a part of Visual Studio, it now has a vibrant open source community and ecosystem around it. This puts it in a funny place. A great way to illustrate that is to visit the following links:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003ca class=\"gblog-post__link\" href=\"https://dotnet.microsoft.com/languages/fsharp\"\u003eF# homepage on the Microsoft .NET site\u003c/a\u003e\n\u003c/li\u003e\n\u003cli\u003e\u003ca class=\"gblog-post__link\" href=\"https://fsharp.org/\"\u003eHomepage for F# and the F# Software Foundation\u003c/a\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThe first link a page on the Microsoft marketing site for .NET. The other is 100% independent of Microsoft, run by the F# Software Foundation, and has been around longer than the marketing site (ironic, given that Microsoft\u0026rsquo;s involvement with F# came well before the F# Software Foundation).\u003c/p\u003e\n\u003cp\u003eThere are other ways you can see this duality play out:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eF# is delivered as a part of Visual Studio vs. F# can be built from source on most Linux distributions\u003c/li\u003e\n\u003cli\u003eF# can target the .NET Framework for Windows apps vs. \u003ca class=\"gblog-post__link\" href=\"https://fable.io/\"\u003eF# can target the JavaScript runtime\u003c/a\u003e\n\u003c/li\u003e\n\u003cli\u003eF# users who primarily use it for OSS vs. those who primarily use it for work (such as at a financial institution)\u003c/li\u003e\n\u003cli\u003ePeople who use Visual Studio Pro/Enterprise or Rider vs. those who use \u003ca class=\"gblog-post__link\" href=\"https://ionide.io/\"\u003eIonide\u003c/a\u003e\n and Visual Studio Code\u003c/li\u003e\n\u003cli\u003eF# users are participate in the F# Software Foundation vs. those who do not\u003c/li\u003e\n\u003cli\u003eF# users who submit issues on GitHub vs. those who do not\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThere are several other examples that I could think of if I was feeling more thoughtful. The two sides of the \u0026ldquo;vs.\u0026rdquo; aren\u0026rsquo;t necessarily opposed. In fact, I know of several F# developers who have different personas depending on their work. But they are very different from one another.\u003c/p\u003e\n\u003cp\u003eThe rest of this post will be a short meditation on this duality. I don\u0026rsquo;t really have a whole lot of insight to offer here. But it is a unique challenge that I face every day.\u003c/p\u003e\n\u003cp\u003eF# is an open source project\nI mention this first because I think it\u0026rsquo;s actually the most important side of the F# project-product duality. Hell, we even say it in the F# marketing page: it\u0026rsquo;s an open source, cross-platform functional language. There you have it, open source and cross-platform. But what does that even mean?\u003c/p\u003e\n\u003cp\u003eFirstly, in case you aren\u0026rsquo;t aware, the F# compiler, F# core library, F# language service, and F# Visual Studio tooling are all 100% open source. You get to observe every bit of mind-numbing process related to flowing commits to different branches, every stupid mistake we make when we introduce a bug, and every \u0026ldquo;whoopsie\u0026rdquo; whenever we say something to a community member and we\u0026rsquo;re proven wrong. And all the good stuff too, like active language development, new tooling features, and countless contributions from people all around the world.\u003c/p\u003e\n\u003cp\u003eThe F# repository is governed, mostly, as such:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWe have a code of conduct and we act on it if necessary. It\u0026rsquo;d be nice if we didn\u0026rsquo;t need it. We banned a white supremacist for sending death threats to F# users and locked any issues he filed.\u003c/li\u003e\n\u003cli\u003eIssues are labeled and assigned a milestone (most of the time!). Milestones are always either \u0026ldquo;Backlog\u0026rdquo; or a release corresponding to a Visual Studio release. Backlog items get pulled into a release milestone if they\u0026rsquo;re completed during the appropriate timeframe.\u003c/li\u003e\n\u003cli\u003eWe may not comment on an issue, often because it is a straightforward bug and just needs to get tagged correctly. But we do strive to look at everything that is filed at least once, and typically do.\u003c/li\u003e\n\u003cli\u003eCode contributions usually require tests or some proof that they work if tests are silly/untenable.\u003c/li\u003e\n\u003cli\u003ePerformance improvements usually require evidence of the improvement to be approved. Sometimes improvements are just obvious, so we\u0026rsquo;ll take them without evidence.\u003c/li\u003e\n\u003cli\u003eNot all parts of the repo can be built everywhere, so we have several Solution files to ensure you can always build the repo in your environment of choice.\u003c/li\u003e\n\u003cli\u003eThe best ideas usually win out on how to do something, and they do get discussed out in the open.\u003c/li\u003e\n\u003cli\u003eSometimes an obvious improvement will be rejected, but it\u0026rsquo;s usually for complicated reasons related to long-term maintenance and support. Sometimes the maintenance cost of adding something outweighs the benefit of users having it. It sucks, I know. But we cannot let technical debt hamstring us.\u003c/li\u003e\n\u003cli\u003eWe have the privilege and the curse of incorporating Visual Studio components. It comes with great testing, compelling language tools, and a much larger userbase than many open source projects. But we are tethered to its processes and this often results in improvements taking time - sometimes months - before they are actually released to users. We try to keep a steady flow of improvements constantly moving in the codebase to remidiate the impact this has.\u003c/li\u003e\n\u003cli\u003eWe have some internal servers that run a \u0026ldquo;signed build\u0026rdquo; for VS integration, it\u0026rsquo;s closed-source, it sucks, and it sometimes stalls our infrastructure from moving forward for a month or two. We apologize, but if it makes you feel better, it slows us down too.\u003c/li\u003e\n\u003cli\u003eThere\u0026rsquo;s more to it, but I think this captures most of how we work in the open. There\u0026rsquo;s some elements of being a product involved (especially as far as Visual Studio integration is concerned), but I like to think that we\u0026rsquo;re really just a very active and fairly well-run open source project.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBut F# as an open source project is more than just the very literal aspects of the actual F# codebase being open source. The \u0026ldquo;F# project\u0026rdquo; involves many other open source entities, some of which include:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eThe \u003ca class=\"gblog-post__link\" href=\"https://github.com/fsprojects\"\u003efsprojects\u003c/a\u003e\n organization, a community-run incubation space that serves as a home for several open source projects (some of which are long past an \u0026ldquo;incubation\u0026rdquo; period!) and has a core group of administrators who ensure that active projects are always assigned at least one maintainer.\u003c/li\u003e\n\u003cli\u003eThe \u003ca class=\"gblog-post__link\" href=\"https://github.com/fslaborg?type=source\"\u003efslab\u003c/a\u003e\n organization, which is basically \u0026ldquo;fsprojects but for data science and machine learning\u0026rdquo;. Several independent projects suited towards analytical work live here, and like fsprojects, there is a core group of administrators who ensure that active projects are always assigned at least one maintainer.\u003c/li\u003e\n\u003cli\u003eThe \u003ca class=\"gblog-post__link\" href=\"https://fable.io/\"\u003eFable\u003c/a\u003e\n project and \u003ca class=\"gblog-post__link\" href=\"https://fable.io/community/\"\u003eecosystem\u003c/a\u003e\n, which transforms F# into a JavaScript-targeting language and comes with a vibrant set of libraries for building beautiful, modern web applications in F#.\u003c/li\u003e\n\u003cli\u003eThe \u003ca class=\"gblog-post__link\" href=\"https://github.com/fsharp/FsAutoComplete\"\u003eFsAutoComplete\u003c/a\u003e\n project, which powers \u003ca class=\"gblog-post__link\" href=\"https://ionide.io/\"\u003eIonide and Visual Studio Code\u003c/a\u003e\n, and F# support in Vim and Emacs.\u003c/li\u003e\n\u003cli\u003eThe \u003ca class=\"gblog-post__link\" href=\"https://ionide.io/\"\u003eIonide\u003c/a\u003e\n project, which turns VSCode into an IDE and also provides several other awesome F# tools.\u003c/li\u003e\n\u003cli\u003eThe \u003ca class=\"gblog-post__link\" href=\"https://safe-stack.github.io/\"\u003eSAFE stack project\u003c/a\u003e\n, which composes several open source projects into a cohesive set that can be used to build full-stack F# apps (F# on the frontend and backend, yes!). Also comes with commercial support through several parties that contribute to SAFE.\u003c/li\u003e\n\u003cli\u003eThe \u003ca class=\"gblog-post__link\" href=\"https://websharper.com/\"\u003eWebSharper project\u003c/a\u003e\n, which is actually also a commercial product, where you build full-stack web apps in F#.\u003c/li\u003e\n\u003cli\u003eThe \u003ca class=\"gblog-post__link\" href=\"https://fsbolero.io/\"\u003ebolero project\u003c/a\u003e\n, which makes F# a WASM language (backed by a commercial entity).\u003c/li\u003e\n\u003cli\u003eThe \u003ca class=\"gblog-post__link\" href=\"https://github.com/JetBrains/fsharp-support\"\u003eJetbrains Rider F# plugin\u003c/a\u003e\n is how F# tooling works in Jetbrains Rider, powered by the same open source language service used by several other open source tools.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThere are many more, but hopefully my point about F# being an open source project matters. There are so many amazing things you can do with the language, all of which is rooted in the fact that F# is cross-platform, open source, and inviting towards a community of developers to empower them to build awesome shit. \u003cstrong\u003eThis is what being an open source project is all about\u003c/strong\u003e.\u003c/p\u003e\n\n\n\n\u003cdiv class=\"gblog-post__anchorwrap\"\u003e\n    \u003ch2 id=\"f-is-a-product\"\u003e\n        F# is a product\n        \u003ca data-clipboard-text=\"https://phillipcarter.dev/posts/fsharp-project-product-duality/#f-is-a-product\" class=\"gblog-post__anchor gblog-post__anchor--right clip\" aria-label=\"Anchor F# is a product\" href=\"#f-is-a-product\"\u003e\n            \u003csvg class=\"icon link\"\u003e\u003cuse xlink:href=\"#link\"\u003e\u003c/use\u003e\u003c/svg\u003e\n        \u003c/a\u003e\n    \u003c/h2\u003e\n\u003c/div\u003e\n\n\u003cp\u003eThe other side of F# is very different, and also has a more storied history. In fact, much of the early history of F# is well-documented in \u003ca class=\"gblog-post__link\" href=\"https://fsharp.org/history/\"\u003eThe Early History of F#\u003c/a\u003e\n, which I highly recommend reading. I won\u0026rsquo;t discuss aspects of F# the product much before the time when I started working on it at Microsoft. This is partly because it\u0026rsquo;s already well-documented, but also because the priorities of a product change over time, and I just don\u0026rsquo;t know the details of what those priorities were prior to 2015.\u003c/p\u003e\n\u003cp\u003eFor what I wager is the majority of F# developers, F# is a product more than it is an open source project. Far more people use the F# compiler and use F# packages than contribute back. This isn\u0026rsquo;t inherently a bad thing, it\u0026rsquo;s just the reality of how things work. Not everyone can or wants to spend their spare time doing open source work, and most people don\u0026rsquo;t have an employer that lets them spend work time on OSS. I really wish employers paid employees to contribute back to the tools and components they use, but most don\u0026rsquo;t, so that\u0026rsquo;s just how it is right now.\u003c/p\u003e\n\u003cp\u003eF# the product surfaces in several ways:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDelivered as a part of the .NET SDK, both Current and LTS trains, across the various mechanisms it can be installed\u003c/li\u003e\n\u003cli\u003eDelivered as a part of the \u003ca class=\"gblog-post__link\" href=\"https://github.com/dotnet/source-build\"\u003ebuild from source\u003c/a\u003e\n packaging for .NET\u003c/li\u003e\n\u003cli\u003eDelivered as a part of Visual Studio\u003c/li\u003e\n\u003cli\u003eDelivered as a part of Visual Studio for Mac\u003c/li\u003e\n\u003cli\u003eDelivered as a part of Jetbrains Rider\u003c/li\u003e\n\u003cli\u003eDelivered as NuGet packages, FSharp.Core and FSharp.Compiler.Service\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eIf you\u0026rsquo;re using F# in Visual Studio, VS for Mac, or Rider then you\u0026rsquo;re doing so under a license. Sometimes that license means it\u0026rsquo;s 100% free (e.g., VS Community - which can be used by students, OSS developers, and small entities making under a certain threshold of revenue). But it\u0026rsquo;s usually a paid license when you\u0026rsquo;re using it professionally, since you\u0026rsquo;re usually doing it for some company that makes money.\u003c/p\u003e\n\u003cp\u003eWhen you\u0026rsquo;re in this setting you likely care deeply about several things:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSetup/prerequisities - Getting a developer and runtime environment set up should be straightfoward. Complex aspects of this are improved over time.\u003c/li\u003e\n\u003cli\u003eLanguage compatibility - What compiled and ran yesterday must compile and run today.\nTooling compatibility - IDE behaviors don\u0026rsquo;t randomly change. Actions you performed yesterday can be performed today.\u003c/li\u003e\n\u003cli\u003eLanguage reliability - New compiler bugs aren\u0026rsquo;t introduced over time. Existing bugs are fixed over time.\u003c/li\u003e\n\u003cli\u003eTooling reliability - Tooling doesn\u0026rsquo;t break with updates. Existing problems are fixed over time.\nCompiler performance - As your codebase grows, the compile times increase linearly with respect to your code size. The linear function isn\u0026rsquo;t too high either. No exponential compile times, thank you! Compiler performance improves over time.\u003c/li\u003e\n\u003cli\u003eRuntime performance - The run time of your application doesn\u0026rsquo;t regress over time. Existing problems are resolved over time and the run time gets faster with updates.\u003c/li\u003e\n\u003cli\u003eTooling performance - As your codebase grows, you don\u0026rsquo;t end up \u0026ldquo;fighting the IDE\u0026rdquo; or some other tool. Existing tooling performance problems are resolved over time, and the tools get faster too.\u003c/li\u003e\n\u003cli\u003eLanguage features - New features that unlock certain capabilities or let you simplify an approach to a problem are regularly delivered. Existing, high-use language features are improved over time.\u003c/li\u003e\n\u003cli\u003eProductivity features - New tooling features that let you see more information, navigate code, refactor code, etc. are regularly delivered. Existing features are enhanced over time.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThere\u0026rsquo;s more, but I think that list covers the fundamentals. None of what I mentioned is exclusive to being a product. Every OSS developer cares about these things too. However, all of this can be achieved by a closed-source, proprietary language implementation and tooling. Community is not required. Extending capabilities for others to explore is not required. Having a diverse group of contributors is not required (although it does mean you need more staff on hand). And if feedback I\u0026rsquo;ve seen over the years is any indicator, plenty of F# developers really don\u0026rsquo;t care much about the aspects of \u0026ldquo;F# is an open source project\u0026rdquo;. After all, there\u0026rsquo;s likely something not running 100% smoothly and the fact that F# can be used to build wonderful new web applications doesn\u0026rsquo;t fix the problem they\u0026rsquo;re seeing. Nor does any number of open source contributors adding features or fixing bugs that don\u0026rsquo;t address the problem they\u0026rsquo;re facing.\u003c/p\u003e\n\u003cp\u003eDealing with the \u0026ldquo;product\u0026rdquo; aspects of F# takes a significant amount of time for me and everyone on the F# team at Microsoft. This isn\u0026rsquo;t exactly surprising, though. We\u0026rsquo;re paid to improve F# the product, so we do exactly that. What does that mean in practice? A few things.\u003c/p\u003e\n\u003cp\u003eFirst and foremost, we try to get more information out of paying customers. Are you working at a company using F# through Visual Studio? Are you paying Microsoft a lot of money through VS subscriptions, Azure subscriptions, and so on? If so, \u003cstrong\u003ewe want to hear from you\u003c/strong\u003e. If you\u0026rsquo;re paying a lot of money then your problems are \u0026ldquo;premium problems\u0026rdquo; that we prioritize above pretty much anything else. Microsoft has gone so far as to pay for me to fly out to a customer and just collect general feedback about using F# because their Azure bill was big enough for us to address general issues they might be having. In one such occaison, we found an embarassing compiler bug where we\u0026rsquo;d stack overflow at build time. The person who told me about it didn\u0026rsquo;t think much of it until my eyes got all wide, baffled as to why his build would fail like that. We got the bug fixed in time for the next Visual Studio update, and with it, a new F# compiler delivered with the fix across all channels. \u003cstrong\u003eWe would not have known about this issue without direct engagement\u003c/strong\u003e.\u003c/p\u003e\n\u003cp\u003eWe have a \u003ca class=\"gblog-post__link\" href=\"https://docs.microsoft.com/en-us/visualstudio/ide/how-to-report-a-problem-with-visual-studio?view=vs-2019\"\u003efeedback system through Visual Studio\u003c/a\u003e\n that can let us know if the person filing the bug is doing so from a paying account, and these are often treated with higher priority than other bugs. Exceptions to this rule are for obscure or \u0026ldquo;the behavior sucks but it\u0026rsquo;s by design and your use case is really just not reasonable\u0026rdquo; issues. If it\u0026rsquo;s one of the rare exceptional cases, we still treat replying and giving the best suggestion we can as a high priority. And in most cases, we\u0026rsquo;ll still move it to GitHub and tag the issue as a low priority so it\u0026rsquo;s clear how we\u0026rsquo;ll treat it. At least then it\u0026rsquo;s known, documented, and if more people come across it we can change the priority based on feedback. Or a curious OSS contributor can fix it themselves!\u003c/p\u003e\n\u003cp\u003eIf you\u0026rsquo;re not using a direct feedback channel or the Visual Studio one, our GitHub tracker is active and we treat triage with a high priority. At this point the blending of \u0026ldquo;F# is a product\u0026rdquo; and \u0026ldquo;F# is an open source project\u0026rdquo; occurs. Once you\u0026rsquo;re on GitHub, it\u0026rsquo;s an open source project. If an issue is low priority for us but high priority for you, you\u0026rsquo;ll need to make a compelling case for us to fix it. Otherwise, we strive to make it as easy as possible for you to fix it yourself and unblock your use case. We\u0026rsquo;ll help you along the way, just like we do any other contributor.\u003c/p\u003e\n\u003cp\u003eOn GitHub, as mentioned earlier, we assign issues to milestones that match a Visual Studio release. Although we\u0026rsquo;re an open source project, users of \u0026ldquo;F# the product\u0026rdquo; really do want to know when a fix or a new feature will become available. It lets us communicate this to people and acts as a nice historical record too. So, what gets priority? This is where things get interesting.\u003c/p\u003e\n\u003cp\u003eManaging an open source project that is also a product\nHopefully it\u0026rsquo;s clear by now that the project-product duality of F# means that the two worlds get blended a lot. This manifests itself in several ways.\u003c/p\u003e\n\u003cp\u003eMost of the time, regressions, crashes, or anything affecting a paying customer gets the top priority for the F# team. Then comes divisional initiatives, like aligning with a .NET release, shipping interop support for a critical new component in .NET, a new tooling experience deemed essential to the .NET product strategy, and so on. Then come longstanding issues that impact your experience a lot, but aren\u0026rsquo;t really a bug so much as a fundamental capability that\u0026rsquo;s missing or designed incorrectly. Finally, the nebulous collection of \u0026ldquo;medium severity\u0026rdquo; issues are dealth with, which is kind of our way of acknowledging that a bug is a legit problem we\u0026rsquo;ll try to get it if we can, but not low enough impact that we\u0026rsquo;ll intentionally scope it out all the time.\u003c/p\u003e\n\u003cp\u003eBut we also go the extra mile to ensure that \u0026ldquo;F# as an open source project\u0026rdquo; is healthy and improving over time. We\u0026rsquo;re constantly tweaking the build of our repository, and usually improving it along the way. We spend a lot of time removing cruft so contributors have less concepts to understand before they can write code. We flesh out APIs that a handful of other open source projects consume, and extend new features so that they are more \u0026ldquo;pluggable\u0026rdquo; for tools like Fable or Bolero. We spend a significant amount of time reviewing contributions and helping people improve their contributions. We \u003ca class=\"gblog-post__link\" href=\"https://www.youtube.com/c/fsharporg/videos?view=0\u0026amp;sort=p\u0026amp;shelf_id=2\"\u003ehost webinars\u003c/a\u003e\n where we walk through the F# compiler, demonstrate how to fix bugs, and give hints about low-friction ways you can contribute. We also try to document things and keep everything up to date through semi-regular audits of our contribution docs.\u003c/p\u003e\n\u003cp\u003eConcretely, this means we all work a lot more than just the working hours we put in for Microsoft. Does that mean we\u0026rsquo;re overworked? I guess so. But it\u0026rsquo;s our choice. It would be a hell of a lot easier for the F# team if F# were another closed-source product, like most of what Microsoft produces. But there\u0026rsquo;s no way in hell we\u0026rsquo;d ever consent to reverting back to the closed-source state that F# the product used to be in. The community we\u0026rsquo;ve been able to connect with and help develop over time is essential. It\u0026rsquo;s essential for F#\u0026rsquo;s standing in the world. It\u0026rsquo;s also essential for our own sanity. Fixing product bugs or doing performance analysis work can actually be quite therapeutic when the person you\u0026rsquo;re fixing it for is positive, engaged, and excited to help. It makes coding fun, and even though it\u0026rsquo;s still \u0026ldquo;product work\u0026rdquo; it\u0026rsquo;s rewarding in its own right. That said, we do tend to be a lot more choosy about the things we work on when it\u0026rsquo;s not working hours!\u003c/p\u003e\n\u003cp\u003eThere are two traps we\u0026rsquo;ve fallen into in the past, and are sure to continue to fall into in the future. The first is not treating a paying customer\u0026rsquo;s issue with the appropriate amount of priority. In the world of open source, most people are consuming something for free. The maintainers have zero obligation to actually fix their issues. However, that is not true for a customer using a product! Maintainers absolutely have an obligation to fix their issues. The inverse can also be a problem. Treating curious but ultimately unimportant problems that people identify as if they impact paying customers is a dangerous trap to fall into. We try to do our best, but please be aware that this is just part and parcel of being open source.\u003c/p\u003e\n\u003cp\u003eHave ideas for how to approach this duality better? I\u0026rsquo;d love to hear about it. You can reach me on twitter or over email.\u003c/p\u003e\n"}]}